#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму (Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		//ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво (Форма);
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда  
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма); 	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

//Поле вводв Контактное лицо
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма) 
	
	Если Форма.Элементы.Найти("КонтактноеЛицо") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ГруппаШапкаПраво") = Неопределено Тогда
		//ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"));
		СледующийЭлемент = Форма.Элементы.Найти("Основание");
		ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, СледующийЭлемент);
	Иначе
		ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	КонецЕсли;
	

	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДОП_КонтактноеЛицо";
	
КонецПроцедуры 


#КонецОбласти