#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму (Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво (Форма);
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда 
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда  
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма); 	
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Поле вводв Контактное лицо
Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво (Форма) 
	
	Если Форма.Элементы.Найти("КонтактноеЛицо") <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Форма.Элементы.Найти("ГруппаШапкаПраво") = Неопределено Тогда
		//ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"));
		СледующийЭлемент = Форма.Элементы.Найти("Основание");
		ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"),, СледующийЭлемент);
	Иначе
		ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), Форма.Элементы.ГруппаШапкаПраво);
	КонецЕсли;
	

	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДОП_КонтактноеЛицо";
	
КонецПроцедуры 

Процедура ДобавитьПолеСогласованнаяСкидкаВГруппаШапкаПраво (Форма)
	
	//Нужно создать группу для удобного расположения на форме // 
	Группа = Форма.Элементы.Добавить("ГруппаСкидка", Тип("ГруппаФормы"), Форма.Элементы.ГруппаШапкаЛево);  
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
	
	ПолеСкидка = Форма.Элементы.Добавить("СогласованнаяСкидка", ТиП("ПолеФормы"), Группа);
	ПолеСкидка.Вид = ВидПоляФормы.ПолеВвода;
	ПолеСкидка.ПутьКДанным = "Объект.ДОП_СогласованнаяСкидка";
	ПолеСкидка.УстановитьДействие("ПриИзменении", "СогласованнаяСкидкаПриИзменении");
	
	
	///Добавление команды
	НоваяКоманда = Форма.Команды.Добавить("ПересчитатьСкидку");
	// Свойство "Действие" содержит имя процедуры-обработчика команды
	НоваяКоманда.Действие = "ПересчитатьСкидку";
	КнопкаРассчитать = Форма.Элементы.Добавить("ПересчитатьСкидку", ТиП("КнопкаФормы"), Группа);
	// Присваиваем команду для созданной кнопке
	КнопкаРассчитать.ИмяКоманды = "ПересчитатьСкидку";
	
КонецПроцедуры


#КонецОбласти